import random
import asyncio
from pyrogram import filters
from FallenRobot import pbot as FallenRobot




WISH_STRINGS = [
                "मेरी वफा की कदर ना की अपनी पसन्द पे एतबार किया होता,सुना है वो उनकी भी ना हुई मुझे छोड़ दिया था तो उसे अपना लिया होता!",
                "मुद्दतों बाद भी नहीं मिलते हम जैसे नायाब लोग तेरे हाथ क्या लग गए तुमने तो हमे आम समझ लिया!",
                "अभी तक मौजूद है इस दिल पर तेरे कदमों के निशां..हमने तेरे बाद किसी को इस राह से गुजरने नहीं दिया!",
                "बेहद करीब है वो शख़्स आज भी मेरे इस दिल के, जिसने खामोशियों का सहारा लेकर दुरियों को अंजाम दिया.",
                "हो सके तो फिर मिलेंगे, शायद अनजान बनकर कोई नई जिंदगी जी कर, कोई नई पहचान बनकर.",
                "ᴋʏᴀ ғᴀʀᴋ ᴘᴀᴅᴛᴀ ʜᴀɪ ᴍᴇʀᴇ ʜᴀsɴᴇ sᴇ ...ᴍᴇʀᴇ ʀᴏɴᴇ sᴇ ᴍᴇʀᴇ ʜᴏɴᴇ sᴇ ...ʏᴀ ᴍᴇʀᴇ ɴᴀ ʜᴏɴᴇ sᴇ... 🥺!",
                "ʏᴇ ʀᴀᴀᴛ ʜᴜᴍꜱᴇ ʙᴏʜᴏᴛ ᴘʏᴀᴀʀ ᴋᴀʀᴛɪ ʜᴀɪɴ,ꜱᴀʙᴋᴏ ꜱᴜʟᴀᴋᴀʀ ʜᴜᴍꜱᴇ ᴀᴋᴇʟᴇ ᴍᴀɪɴ ʙᴀᴀᴛ ᴋᴀʀᴛɪ ʜᴀɪ...!!🥺💔🥺!",
                "ᴛᴜᴊʜᴇ ᴅᴜꜱʀᴏ ꜱᴇ ʙᴀᴀᴛ ᴋᴀʀᴛᴇ ᴅᴇᴋʜᴀ ᴛᴏʜ ᴅᴜᴋʜ ʜᴜᴀ....! ꜰɪʀ ʏᴀᴀᴅ ᴀᴀʏᴀ ᴋɪ ʜᴜᴍ ᴋᴏɴꜱᴇ ᴛᴇʀᴇ ᴀᴘɴᴇ ʜᴀɪ.....💔💔.",
                "ᴍɪʟᴏ ᴇᴋ ʙᴀᴀʀ ᴋᴏ ᴛᴜᴍ sʜɪᴅᴅᴀᴛ sᴇ ᴇᴋ ʙᴀᴀᴛ ᴋᴀʀɴɪ ʜᴀɪ ᴛᴜᴊʜsᴇ ɢᴀʟᴇ ʟᴀɢ ᴋᴀʀ ..... ᴛᴇʀɪ ʜɪ sʜɪᴋᴀʏᴛᴇ ʜᴀᴊᴀʀ ᴋᴀʀɴɪ ʜᴀɪ......",
                "ᴛᴜᴍ ᴀᴀɴᴀ ᴍᴇʀᴇ ᴊᴀɴᴀᴢᴇʏ ᴘᴀʀ ᴇᴋ ᴀᴀᴋʜʀɪ ʜᴀꜱᴇᴇɴ ᴍᴜʟᴀᴋᴀᴀᴛ ʜᴏɢɪ,ᴍᴇʀᴇ ᴊɪꜱᴍ ᴍᴇɪ ʙᴇꜱʜᴀQ ᴊᴀᴀɴ ɴᴀ ʜᴏ ᴍᴇʀɪ ᴊᴀᴀɴ ᴛᴏʜ ᴍᴇʀᴇ ᴘᴀᴀꜱ ʜᴏɢɪ..!🥺❤️."
               ]


@FallenRobot.on_message(filters.command(["rakshabandhan", "rakhi"]))
async def lel(bot, message):
    ran = random.choice(WISH_STRINGS)
    await bot.send_chat_action(message.chat.id, "Typing")
    await asyncio.sleep(1)
    return await message.reply_text(text=ran)

__mod_name__ = "ꜱᴀᴅ-ꜱʜᴀʏᴀʀɪ"

__help__ = """

*ᴍᴀᴋᴇs ᴀ ꜱᴀᴅ-ꜱʜᴀʏᴀʀɪ ǫᴜᴏᴛᴇ ғᴏʀ ᴜʀ ꜱᴀᴅ-ꜱʜᴀʏᴀʀɪ & ꜰᴇᴇʟɪɴɢꜱ* \n*ᴀɴᴅ sᴇɴᴅ ɪᴛ ᴛʜᴇᴍ.*

❍ /SadShayari *:* *ᴡʀɪᴛᴇ ᴀ ǫᴜᴏᴛᴇ ғᴏʀ ʏᴏᴜʀ ꜱʜᴀʏᴀʀɪ.* \n\n ❍ /feelings *:* *ᴡʀɪᴛᴇ ǫᴜᴏᴛᴇ ғᴏʀ ʏᴏᴜʀ ꜰᴇᴇʟɪɴɢꜱ!!.* \n\n [🥀Support Chat🥀](t.me./Team_STD_Network)

 """
